# 控制发牌的牌值(随机选取，最小也是6点)
LET_CARD_VALUE = [6, 7, 8, 9]

# 1.撒铺阶段，计算庄大过当前牌的概率进行撒铺操作
# union_pro >= 0.95 and product >= 0.6(亮牌、密、闷赔)
# 庄任意一铺大过闲的概率 > 95%, 两铺都大过的概率 > 0.6(相当于庄两铺都大过闲有80%以上的概率)
p1 = [0.55, 0.25, 0.2]
p1_1 = [0.2, 0.8]
p1_11 = [0.9, 0, 0.1]  # 冲榜赛(亮牌|密|闷赔)

# union_pro >= 0.85 and product >= 0.36(亮牌、密、闷赔)
# 庄任意一铺大过闲的概率 > 80%, 两铺都大过的概率 > 0.36(相当于庄两铺都大过闲有60%以上的概率)
p2 = [0.84, 0.1599, 0.0001]
p2_1 = [0.2, 0.8]

# union_pro <= 0.25(亮牌、强攻、密)
# 庄任意一铺大过闲的概率 <= 25% (相当于闲两铺都大过庄有90%以上的概率)
p3 = [0.6, 0.1, 0.3]  # 无对
p4 = [0, 0.2, 0.8]  # 有对

p3_1 = [0.3, 0.1, 0.6]
p4_1 = [0, 0.1, 0.9]

# union_pro <= 0.36 and product <= 0.05(亮牌、强攻、密)
# 庄任意一铺大过闲的概率 <= 36%, 两铺都大过闲的概率 <= 0.05(相当于闲两铺都大过庄有80%以上的概率)
p5 = [0.8, 0.05, 0.15]  # 无对
p6 = [0.4, 0.2, 0.4]  # 有对

p5_1 = [0.8, 0, 0.2]  # 无对
p6_1 = [0.5, 0, 0.5]  # 有对

# union_pro <= 0.52 and product <= 0.12
# 庄任意一铺大过闲的概率：36% ~ 52%, 两铺都大过闲的概率: 5% ~ 12%
p7 = [0.99, 0.0001, 0.0099]
p8 = [0.93, 0.001, 0.069]

# 2.庄杀阶段，庄面对闲密牌的各种情况
# 庄小铺 >= 5 (开、认)
p9 = [0.9, 0.1]

# 当庄大铺有9点且为1+8和9花的情况
p10 = [0.7, 0.3]

# union_pro <= 0.8 and product <= 0.3
# 庄任意一铺小于闲的概率为：80%, 庄两铺都小于闲的概率为50% ~ 60%
p11 = [0.1, 0.9]

# 当密牌玩家为庄杀的前一两个玩家时
p12 = [0.15, 0.85]

# 确定策略，欺诈策略，通杀策略
# p13 = [0, 0, 1]
p13 = [0.845, 0.15, 0.005]

# 3.配牌阶段
# 手牌值 = 18且有对子
p14 = [0.2, 0.2, 0.6]
p15 = [0.15, 0.15, 0.7]
# 手牌值 >= 15且有对子(庄)
p16 = [0.05, 0.05, 0.9]  # 无对 无对 有对
p17 = [0.1, 0.1, 0.8]  # 无对无对有对

# 机器人撒铺延时
start_rs = [1, 2, 3, 4, 5]

# 比牌控制(当牌一样时，比大铺还是小铺花色)
is_bigger = True

# 庄闲操作异常阈值
# 闲闷赔(牌值小于等于多少当作异常)
mp_b_threshold = 4
mp_s_threshold = 2

# 闲强攻(牌值小于等于多少算异常)
qg_b_threshold = 7
qg_s_threshold = 3

# 庄面对密不开(牌值大于等于多少算异常)
mi_no_kai_s = 7

# 癞子版扯牌顾小牌阈值
THRESHOLD_NUM = 5